<a href="https://colab.research.google.com/github/sureshmecad/Google-Colab/blob/master/1_PANDAS_Basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#### **set_index() function**

https://www.w3resource.com/pandas/dataframe/dataframe-set_index.php

----------

#### **1) Comparison Operators**

##### **Example 1**

In [5]:
import pandas as pd

In [6]:
df = pd.DataFrame({'A': [1,4,7],
                  'B': [2,5,8],
                  'C': [3,6,9]})
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [8]:
subset_df = df[(df["A"] >= 1) & (df["B"] < 5)]
subset_df

   A  B  C
0  1  2  3

##### **Example 2**

In [9]:
df1 = pd.DataFrame({'city': ['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali', 'Bengaluru', 'Coimbatore', 'Srirangam', 'Pondicherry'],
                   'Temperature': [15, 22, 20, 26, -2, 24, 35, 36, 39]})
df1

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
5    Bengaluru           24
6   Coimbatore           35
7    Srirangam           36
8  Pondicherry           39

- Select the part of the dataframe such that it contains **cities** where **temp is less then or equal to 20**. How many cities are there?

In [10]:
df1[(df1['Temperature']<= 20)]

         city  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2

- Select the part of the dataframe such that it contains the **cities** where **tempearature greater than or equal to 35**

In [11]:
df1[(df1['Temperature']>= 35)]

          city  Temperature
6   Coimbatore           35
7    Srirangam           36
8  Pondicherry           39

##### **Example 3**